Tekla Open API Reference for Tekla Structures 2025
TaskDependency Constructor
Overload List
Name | Description
TaskDependency()
 Creates a new task dependency instance.
TaskDependency(Task, Task)
 Creates a new task dependency instance with the given primary and secondary tasks.
Top
See Also
Reference
TaskDependency Class
Tekla.Structures.Model Namespace